Tekla Open API Reference for Tekla Structures 2025
GridBase.IsMagnetic Property
 Gets or sets whether the grid is magnetic or not.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public virtual bool IsMagnetic { get; set; }
Public Overridable Property IsMagnetic As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GridBase Class
Tekla.Structures.Model Namespace